{
  "spotifyInfo": {
    "key": "7",
    "mode": "0",
    "valence": "0.342",
    "danceability": "0.522",
    "energy": "0.074",
    "tempo": "135.298",
    "genre": "indie-pop"
  },
  "artists": "Elliott Smith",
  "title": "Between the Bars",
  "duration": 138.213878,
  "lyrics": [
    {
      "timeStamp": 11.19,
      "lyrics": "Drink up baby, stay up all night"
    },
    {
      "timeStamp": 15.18,
      "lyrics": "With the things you could do"
    },
    {
      "timeStamp": 17.82,
      "lyrics": "You won't but you might"
    },
    {
      "timeStamp": 20.12,
      "lyrics": "The potential you'll be that you'll never see"
    },
    {
      "timeStamp": 25.88,
      "lyrics": "The promises you'll only make"
    },
    {
      "timeStamp": 30.38,
      "lyrics": "Drink up with me now"
    },
    {
      "timeStamp": 33.2,
      "lyrics": "And forget all about the pressure of days"
    },
    {
      "timeStamp": 38.71,
      "lyrics": "Do what I say and I'll make you okay"
    },
    {
      "timeStamp": 44.26,
      "lyrics": "And drive them away"
    },
    {
      "timeStamp": 46.83,
      "lyrics": "The images stuck in your head"
    },
    {
      "timeStamp": 52.26,
      "lyrics": "People you've been before"
    },
    {
      "timeStamp": 57.32,
      "lyrics": "That you don't want around anymore"
    },
    {
      "timeStamp": 62.95,
      "lyrics": "That push and shove and won't bend to your will"
    },
    {
      "timeStamp": 69.45,
      "lyrics": "I'll keep them still"
    },
    {
      "timeStamp": 74.18,
      "lyrics": "Drink up baby, look at the stars"
    },
    {
      "timeStamp": 78.47,
      "lyrics": "I'll kiss you again, between the bars"
    },
    {
      "timeStamp": 83.86,
      "lyrics": "Where I'm seeing you there with your hands in the air"
    },
    {
      "timeStamp": 89.37,
      "lyrics": "Waiting to finally be caught"
    },
    {
      "timeStamp": 94.06,
      "lyrics": "Drink up one more time, and I'll make you mine"
    },
    {
      "timeStamp": 100.12,
      "lyrics": "Keep you apart, deep in my heart"
    },
    {
      "timeStamp": 104.91,
      "lyrics": "Separate from the rest, where I like you the best"
    },
    {
      "timeStamp": 110.85,
      "lyrics": "And keep the things you forgot"
    },
    {
      "timeStamp": 116.24,
      "lyrics": "People you've been before"
    },
    {
      "timeStamp": 121.58,
      "lyrics": "That you don't want around anymore"
    },
    {
      "timeStamp": 126.75,
      "lyrics": "That push and shove and won't bend to your will"
    },
    {
      "timeStamp": 133.89,
      "lyrics": "I'll keep them still"
    },
    {
      "timeStamp": 136.55,
      "lyrics": ""
    }
  ],
  "lyricsAnnotations": [
    {
      "lyrics": "And I’ll make you okay and drive them away\n The images stuck in your head",
      "annotation": [
        "One of Smith’s more notable lyrical skills is his ability to convey so much with so little.\n\nThis line ‘And I’ll make you okay and drive them away’ brings many ideas of hysteria, a craving to run away, perhaps it emphasises Smith’s need for his alcoholic crutch to keep ‘them’  away because he is too weak to do so himself.\n\nGiving into this cycle of alcohol soothing him repeatedly with every swig is dangerous, it suggests Elliott it trapped in a cycle of apparent sanctity and is so deluded he cannot escape – But he doesn’t have to worry because the alcohol will ‘make you okay’. Sadly, of course, it doesn’t.\n\n‘The images stuck in your head’ tells us he is troubled. His past actions and horrible experiences he has undergone have plagued his mid with these ‘images stuck’ in his head.\n\n\n\n Just one of the many reasons Elliott not only wants but needs this drink."
      ]
    },
    {
      "lyrics": "The potential you’ll be, that you’ll never see\n The promises you’ll only make",
      "annotation": [
        "If you continue to read alcohol as the narrator, this is the bitterly realistic version of its siren’s call. Bundled with its promises of pleasure and satisfaction is the underlying truth of its destructive elements. If the addressee gives in and “drinks up” they will forfeit their potential in exchange for a moment of numbness."
      ]
    },
    {
      "lyrics": "The people you’ve been before that you\n Don’t want around anymore\n That push and shove and won’t bend to your will\n I’ll keep them still",
      "annotation": [
        "The chorus like his battle with alcoholism is both repetitive and constant. It ends the song to show how he is stuck in the inescapable cycle of drinking that when it ends it simply begins again.\n\nThis becomes clear if the song is listened to on repeat as it literally fulfils this cycle, flowing seamlessly into the intro again."
      ]
    },
    {
      "lyrics": "And keep the things you forgot",
      "annotation": [
        "Alcohol has seduced him throughout the song, and, now that it’s finally succeeded, it reveals that although it allows him to forget, it always remembers. There is no escaping the truth, and alcohol will always remember. As the saying goes: in vino veritas (there is truth in wine). Therefore the subject is stuck in a self-perpetuating cycle where he must drink to balm himself from life and his truths, yet the drink always remembers past truths he’s forgotten and so forces him to drink more as the repressed former memories are also liberated when he’s drunk."
      ]
    },
    {
      "lyrics": "Keep you apart, deep in my heart\n Separate from the rest, where I like you the best",
      "annotation": [
        "A truly seductive ending before the last chorus with the drink finally emerging as the more appropriate reading of the song. It tempts Smith, flattering him into submission, telling him that he is its favorite.\n\nAddiction breeds isolation. Alcohol promises to be there and encourages Smith to forgo all other relationships."
      ]
    },
    {
      "lyrics": "Drink up one more time and I’ll make you mine",
      "annotation": [
        "I imagine a glass of whisky whispering this to Elliott in a bar."
      ]
    },
    {
      "lyrics": "Drink up, baby, look at the stars\n I’ll kiss you again, between the bars\n Where I’m seeing you there, with your hands in the air\n Waiting to finally be caught",
      "annotation": [
        "This verse exhibits some of Smith’s most intricate and meticulous lyricism.\n\nThe first line refers to someone taking a swig from a bottle of alcohol and, thus, looking up towards the stars. The second line refers to the mouth of the bottle “kissing” his lips.\n\nThe line “between the bars” opens up many possible interpretations. It may refer to\n\n\nThe time in-between actual bars, where he bought the bottle and wanders to the next bar\nThe time in-between a music bar, often used to sip from a drink while performing\nBetween prison bars, further fleshing out the metaphor of addiction/alcoholism as a prison\n\n\n\nThe final two lines can be interpreted to support all three of these possibilities:\n\n\nSmith could be waving his hands, attempting to get the bartenders attention to order another drink\nSmith could be looking out on the cheering audience from his perch on the stage\nThe force of addiction is so strong, that even though Smith recognizes it as a prison, he still eagerly turns himself in"
      ]
    },
    {
      "lyrics": "People you’ve been before that you\n Don’t want around anymore\n That push and shove and won’t bend to your will\n I’ll keep them still",
      "annotation": [
        "Elliott is tortured by his past actions and ideas and uses alcohol as his coping mechanism. These past selves, whether they be healthy or detrimental, whether they caused him to love or lose love, are unbearable to him in his current state. Alcohol promises to numb their influence on him and “keep them still”, putting at rest a mind that is clearly buzzing with past turmoil. The notion of “bending to [his] will” also shows how Elliott feels helpless and yearns to be in control, preferring to repress these memories or feelings rather than let their possibility torture him."
      ]
    },
    {
      "lyrics": "Drink up with me now and forget all about\n The pressure of days, do what I say",
      "annotation": [
        "Every passing day can be pressuring and tedious as the entire world comes down upon your head, crippling depression and suicidal thoughts will only overwhelm you. Forget everything that has happened, all you need to do is keep on drinking and wash all these distressing thoughts down the drain."
      ]
    },
    {
      "lyrics": "Drink up, baby, stay up all night\n With the things you could do, you won’t but you might",
      "annotation": [
        "The alcohol is speaking to him. The song is not about Elliott comforting a girl, but about alcohol comforting him. Here the alcohol tempts him telling him to stay up drinking.\n\nNoticeably the alcohol speaks to him in the voice of a temptress. Referring to him as ‘baby’ it takes on the role of forceful femme fatale almost seducing him into temptation by tantalisingly telling him of his potential: ‘the things you could do’ and the drunk persona he could adopt ‘you won’t but you might.’\n\nThe line “you won’t but you might” also has interesting connotations. It conveys this sense of known futility: even with the potential granted to him through his alcohol abuse, he still knows that he is not capable of achievement. However, he indulges because that feeling of possibility is still tantalizing, even if he’s implicitly given up on his own ability."
      ]
    }
  ],
  "sections": [
    {
      "explanation": "The first verse introduces the theme of longing and potential.",
      "mood": ["yearning", "reflective"],
      "chaos_level": 0.2,
      "energy": 0.3,
      "texture": 0.3,
      "colors": ["#B7C0C5", "#96A3A8", "#798C91", "#596C72", "#394D52"],
      "harmony": 0.85,
      "start": 11.19,
      "duration": 14.69
    },
    {
      "explanation": "The second verse delves into the struggles of escaping pressures and memories.",
      "mood": ["troubled", "hopeful"],
      "chaos_level": 0.35,
      "energy": 0.4,
      "texture": 0.4,
      "colors": ["#C1C5B7", "#A8AB96", "#919379", "#727359", "#524939"],
      "harmony": 0.75,
      "start": 25.88,
      "duration": 23.57
    },
    {
      "explanation": "The chorus emphasizes the escapism presented by alcohol, with recurring imagery of stillness and isolation.",
      "mood": ["escapist", "melancholic"],
      "chaos_level": 0.25,
      "energy": 0.5,
      "texture": 0.3,
      "colors": ["#C5B7B8", "#AB9697", "#91797A", "#73595A", "#523939"],
      "harmony": 0.8,
      "start": 52.26,
      "duration": 22.92
    },
    {
      "explanation": "The third verse offers a subtle shift, introducing an ethereal quality with the imagery of stars.",
      "mood": ["ethereal", "longing"],
      "chaos_level": 0.3,
      "energy": 0.6,
      "texture": 0.4,
      "colors": ["#B7C5B7", "#96ABA9", "#79A091", "#597C72", "#396052"],
      "harmony": 0.75,
      "start": 74.18,
      "duration": 25.19
    },
    {
      "explanation": "The outro returns to the repetitive chorus, emphasizing the cyclical nature of the narrative.",
      "mood": ["resigned", "cyclical"],
      "chaos_level": 0.25,
      "energy": 0.45,
      "texture": 0.3,
      "colors": ["#C5C5B7", "#ABAB96", "#919179", "#727259", "#525239"],
      "harmony": 0.8,
      "start": 116.24,
      "duration": 20.5
    }
  ],
  "song_start": {
    "explanation": "The song begins with a gentle introduction, setting the tone of melancholy and introspection.",
    "mood": ["melancholic", "introspective"],
    "chaos_level": 0.2,
    "energy": 0.2,
    "texture": 0.2,
    "colors": ["#A9B7C1", "#839DA4", "#6D848D", "#577078", "#3F575F"],
    "harmony": 0.8,
    "start": 0,
    "duration": 11.19
  },
  "song_end": {
    "explanation": "The song ends quietly, leaving an impression of unresolved emotions and lingering melancholy.",
    "mood": ["melancholic", "unresolved"],
    "chaos_level": 0.15,
    "energy": 0.2,
    "texture": 0.2,
    "colors": ["#B7C1C5", "#96A9AB", "#798F91", "#596F72", "#394F52"],
    "harmony": 0.85,
    "start": 136.74,
    "duration": 1.473877999999985
  },
  "mp3_file": "between-the-bars-elliott-smith.mp3"
}
