{
  "spotifyInfo": {
    "key": "0",
    "mode": "1",
    "valence": "0.102",
    "danceability": "0.445",
    "energy": "0.543",
    "tempo": "99.963",
    "genre": "indie-pop"
  },
  "artists": "Mitski",
  "title": "First Love  Late Spring",
  "duration": 278.726531,
  "lyrics": [
    {
      "timeStamp": 10.42,
      "lyrics": "The black hole of the window where you sleep"
    },
    {
      "timeStamp": 29.69,
      "lyrics": "The night breeze carries something sweet"
    },
    {
      "timeStamp": 44.07,
      "lyrics": "A peach tree"
    },
    {
      "timeStamp": 48.95,
      "lyrics": "Wild women don't get the blues"
    },
    {
      "timeStamp": 55.44,
      "lyrics": "But I find that"
    },
    {
      "timeStamp": 58.41,
      "lyrics": "Lately, I've been crying like a tall child"
    },
    {
      "timeStamp": 67.45,
      "lyrics": "So please, hurry, leave me, I can't breathe"
    },
    {
      "timeStamp": 74.2,
      "lyrics": "Please don't say you love me"
    },
    {
      "timeStamp": 78.78,
      "lyrics": "胸がはち切れそうで"
    },
    {
      "timeStamp": 83.65,
      "lyrics": ""
    },
    {
      "timeStamp": 87.26,
      "lyrics": "One word from you and I would"
    },
    {
      "timeStamp": 91.88,
      "lyrics": "Jump off of this ledge I'm on, baby"
    },
    {
      "timeStamp": 97.74,
      "lyrics": "Tell me \"don't\", so I can crawl back in"
    },
    {
      "timeStamp": 106.05,
      "lyrics": ""
    },
    {
      "timeStamp": 135.38,
      "lyrics": "And I was so young when I behaved 25"
    },
    {
      "timeStamp": 144.52,
      "lyrics": "Yet now, I find I've grown into a tall child"
    },
    {
      "timeStamp": 154.05,
      "lyrics": "And I don't wanna go home"
    },
    {
      "timeStamp": 158.66,
      "lyrics": "Let me walk to the top of the big night sky"
    },
    {
      "timeStamp": 164.11,
      "lyrics": "Please, hurry, leave me, I can't breathe"
    },
    {
      "timeStamp": 169.75,
      "lyrics": "Please don't say you love me"
    },
    {
      "timeStamp": 174.35,
      "lyrics": "胸がはち切れそうで"
    },
    {
      "timeStamp": 180.77,
      "lyrics": ""
    },
    {
      "timeStamp": 183.33,
      "lyrics": "One word from you and I would"
    },
    {
      "timeStamp": 187.88,
      "lyrics": "Jump off of this ledge I'm on, baby"
    },
    {
      "timeStamp": 193.74,
      "lyrics": "Tell me \"don't,\" so I can crawl back in"
    },
    {
      "timeStamp": 200.71,
      "lyrics": ""
    },
    {
      "timeStamp": 221.89,
      "lyrics": "One word from you and I would"
    },
    {
      "timeStamp": 226.22,
      "lyrics": "Jump off of this ledge I'm on, baby"
    },
    {
      "timeStamp": 232.24,
      "lyrics": "Tell me \"don't,\" so I can crawl back in"
    },
    {
      "timeStamp": 238.26,
      "lyrics": ""
    },
    {
      "timeStamp": 253.28,
      "lyrics": "Please, hurry, leave me, I can't breathe"
    },
    {
      "timeStamp": 259.05,
      "lyrics": ""
    }
  ],
  "lyricsAnnotations": [
    {
      "lyrics": "One word from you and I would",
      "annotation": [
        "Mitski is so in love with the partner shes singing about that she would dedicate her entire existence to them, risks and dangers of it becoming irrelevant due to love blinding her rational judgement. They could say anything and she would do, even if it involved jumping off a ledge.\n\nThis lyric could also refer to the idea that if only her lover chose to say that little word, and if they wanted to stop the relationship, Mitski would abandon the ledge that is her obsession, with its development making sense due to the implication that Mitskis mentality is childlike (children tend to attach to people they admire) and also unexperienced as it is her first love, representing the way it affects her thinking and view of things, much like seeing a view from a high point. Like that, the rejection becomes beneficial on both sides: the person gets what they want and Mitski is freed from feeling so miserable. Mitski is craving to get rid of the desperate feeling she’s had from a relationship that seems to be going wrong and a fragile mental state, and asks to be freed from it by her partner who she admires and who’s word she will always consider"
      ]
    },
    {
      "lyrics": "One word from you and I would",
      "annotation": [
        "Mitski is so in love with the partner shes singing about that she would dedicate her entire existence to them, risks and dangers of it becoming irrelevant due to love blinding her rational judgement. They could say anything and she would do, even if it involved jumping off a ledge.\n\nThis lyric could also refer to the idea that if only her lover chose to say that little word, and if they wanted to stop the relationship, Mitski would abandon the ledge that is her obsession, with its development making sense due to the implication that Mitskis mentality is childlike (children tend to attach to people they admire) and also unexperienced as it is her first love, representing the way it affects her thinking and view of things, much like seeing a view from a high point. Like that, the rejection becomes beneficial on both sides: the person gets what they want and Mitski is freed from feeling so miserable. Mitski is craving to get rid of the desperate feeling she’s had from a relationship that seems to be going wrong and a fragile mental state, and asks to be freed from it by her partner who she admires and who’s word she will always consider"
      ]
    },
    {
      "lyrics": "One word from you and I would",
      "annotation": [
        "Mitski is so in love with the partner shes singing about that she would dedicate her entire existence to them, risks and dangers of it becoming irrelevant due to love blinding her rational judgement. They could say anything and she would do, even if it involved jumping off a ledge.\n\nThis lyric could also refer to the idea that if only her lover chose to say that little word, and if they wanted to stop the relationship, Mitski would abandon the ledge that is her obsession, with its development making sense due to the implication that Mitskis mentality is childlike (children tend to attach to people they admire) and also unexperienced as it is her first love, representing the way it affects her thinking and view of things, much like seeing a view from a high point. Like that, the rejection becomes beneficial on both sides: the person gets what they want and Mitski is freed from feeling so miserable. Mitski is craving to get rid of the desperate feeling she’s had from a relationship that seems to be going wrong and a fragile mental state, and asks to be freed from it by her partner who she admires and who’s word she will always consider"
      ]
    },
    {
      "lyrics": "Tell me, ”Don’t”, so I can crawl back in",
      "annotation": [
        "when someone is about to end their life all someone can do is tell them “not to” or “don’t” they obviously mean what they’re saying but is that really enough? its enough to keep the person alive but not keep the person happy and content. This person will tell Mitski “not to do it” and when she doesn’t he will leave her once again and she will “crawl back in”"
      ]
    },
    {
      "lyrics": "The black hole of the window where you sleep\n The night breeze carries something sweet, a peach tree",
      "annotation": [
        "Before Mitski got famous she had a cheeky little hole in her window. This little black hole takes in a sweet breeze, and the smell of the peach tree that was outside her window at the time.\n\nSome people might interpret as if the hole is a metaphor for something or someone, that even tho someone is ruining something that would’ve been so clear and easy, that theres still is something sweet and nice in it.\n\nThat sweet breeze that comes from black hole in her window could also represent the little hope that comes in life every once in a while.\n\nThe “black hole” may refer to an empty space,  meaning that the person/lover who slept there is not there anymore. This would maybe help to understand why Mitski said afterwards “Wild women don’t get the blues.” It means she was sad and she could’ve been sad because her lover was no longer sleeping there."
      ]
    },
    {
      "lyrics": "So please, hurry, leave me, I can’t breathe\n Please don’t say you love me",
      "annotation": [
        "Mitski’s love for this person is so intense that she wants them to leave so she’s relieved of this overwhelming emotion. If they said they loved her, it would only solidify the feeling and make everything more real, which is a terrifying prospect for her."
      ]
    },
    {
      "lyrics": "[Instrumental Bridge]",
      "annotation": [
        "This interlude almost feels like a momentary release, a brief surrender to the suffocating longing the narrator feels.\n\nModulation to a higher key in pop music is commonly understood to announce the song’s climactic finish (see Whitney Houston’s “I Will Always Love You” for a popular example). In most of these cases, the song either maintains the new key to its conclusion or modulates again to a higher key. Here, however, the key is only briefly maintained and is quickly cut off by the outro.\n\nMitski’s choice to return to the original key after modulating deprives the interlude of a satisfying resolution and instills a sense of disappointment in the listener. This mirrors the song’s themes of frustration. It is a momentary lapse of restraint anxiously interrupted by a return to denial."
      ]
    },
    {
      "lyrics": "And I don’t wanna go home yet\n Let me walk to the top of the big night sky",
      "annotation": [
        "Throughout the song Mitski references “crying like a tall child” and “I’ve grown in to a tall child”, the way I interpreted this line was that as a child you always say to your parents “I don’t want to go home yet” and her referencing that in the song is almost a childlike thing to say so it carries the theme of the song, of being an adult but still “acting” and feeling like a child.\n\nThe last line ties back to the “ledge” she’s found herself on. There’s some childlike sense of adventure in the idea of walking to the top of big night sky, but she doesn’t want to go home yet (feeling intoxicated) and wanders up to the top of the night sky (possibly related to the feeling like you’re high or like you’re floating when you’re in love), but it’s sandwiched between the chorus of feeling overwhelmed and too much, like you’re stuck up on a ledge way up high and need to be helped off. Like a child who’s in over their head."
      ]
    },
    {
      "lyrics": "But I find that\n Lately, I’ve been crying like a tall child",
      "annotation": [
        "Being a “tall child” can be interpreted as having a child like maturity or mind set while being stuck in Mitski’s adult body. In this statement, she could be saying that lately she (in her adult form) has been crying in a way she hasn’t since she was a child or in a manner that she associates as childish. Mitski continues to use this phrasing of “tall child” later in the song when she sings, “And I was so young when I behaved twenty five. Yet now I find I’ve grown into a tall child.\""
      ]
    },
    {
      "lyrics": "And I was so young when I behaved twenty-five\n Yet now, I find I’ve grown into a tall child",
      "annotation": [
        "Here, Mitski explains how she felt more mature in her childhood than she does or did as an adult in this relationship. She is described as a “tall” child, meaning that she sees her self-worth as that of a child in an adult body. This showcases to us that the relationship she was/is in made her highly dependant (like a child). It could also mean that she finds herself being more emotional right now as an adult, than she ever did as a child.\n\nThe line “I was so young when I behaved twenty five” may also mean that people told her from a young age that she was very mature for her age so she adapted that into her personality in order to not disappoint them (we’ve seen from songs like “Real Men” that she’s learned to need male validation, so maybe a father figure pushed this idea on her and so she wanted to please them by acting the way they wanted her to). This led to her hiding her true feelings and probably missing out on on a lot from her childhood. Now that she she’s grown, she realises the trauma these people have caused her and so she tries to live these “childish” feeling she never was allowed to have."
      ]
    }
  ],
  "sections": [
    {
      "explanation": "First verse introduces the lyrics and sets a poetic and slightly melancholic tone.",
      "mood": ["poetic", "melancholic", "serene"],
      "chaos_level": 0.2,
      "energy": 0.3,
      "texture": 0.3,
      "colors": ["#241A1A", "#6E4B4B", "#BF6F6F", "#998E8E", "#4D3A3A"],
      "harmony": 0.7,
      "start": 10.42,
      "duration": 28.27
    },
    {
      "explanation": "Second verse explores deeper emotions of longing and bittersweetness.",
      "mood": ["longing", "bittersweet", "introspective"],
      "chaos_level": 0.3,
      "energy": 0.4,
      "texture": 0.4,
      "colors": ["#3C2A2A", "#775151", "#B28787", "#9E5959", "#503C3C"],
      "harmony": 0.6,
      "start": 48.95,
      "duration": 20.5
    },
    {
      "explanation": "Chorus intensifies the emotional expression, highlighting themes of desperation and vulnerability.",
      "mood": ["intense", "desperate", "vulnerable"],
      "chaos_level": 0.4,
      "energy": 0.5,
      "texture": 0.5,
      "colors": ["#472B2B", "#8F5E5E", "#DC8C8C", "#B26D6D", "#6A4141"],
      "harmony": 0.5,
      "start": 67.45,
      "duration": 34.83
    },
    {
      "explanation": "Bridge provides a reflective, almost ethereal interlude, shifting the mood slightly.",
      "mood": ["reflective", "ethereal", "dreamlike"],
      "chaos_level": 0.3,
      "energy": 0.3,
      "texture": 0.6,
      "colors": ["#1E2A2A", "#4B6464", "#6FBFBF", "#517A7A", "#2B4545"],
      "harmony": 0.7,
      "start": 106.05,
      "duration": 29.33
    },
    {
      "explanation": "Next verse continues the narrative, revisiting themes with renewed depth and poignancy.",
      "mood": ["poignant", "nostalgic", "introspective"],
      "chaos_level": 0.3,
      "energy": 0.4,
      "texture": 0.3,
      "colors": ["#2F2C2C", "#5B5040", "#8F8C6D", "#73705A", "#464338"],
      "harmony": 0.6,
      "start": 135.38,
      "duration": 58.73
    },
    {
      "explanation": "Final chorus emphasizes the climax of the emotional journey before a reflective conclusion.",
      "mood": ["climactic", "emotional", "reflective"],
      "chaos_level": 0.4,
      "energy": 0.6,
      "texture": 0.6,
      "colors": ["#363232", "#716868", "#AFA493", "#8F8579", "#5A5147"],
      "harmony": 0.5,
      "start": 221.89,
      "duration": 37.15
    }
  ],
  "song_start": {
    "explanation": "The song begins with a gentle instrumental introduction, setting the tone for an introspective and deeply emotional journey.",
    "mood": ["introductory", "reflective", "subdued"],
    "chaos_level": 0.1,
    "energy": 0.2,
    "texture": 0.2,
    "colors": ["#242424", "#8C8C8C", "#FFFFFF", "#646464", "#A8A8A8"],
    "harmony": 0.8,
    "start": 0,
    "duration": 10.42
  },
  "song_end": {
    "explanation": "The song closes with an instrumental outro, fading gently to silence.",
    "mood": ["calm", "reflective", "wistful"],
    "chaos_level": 0.1,
    "energy": 0.2,
    "texture": 0.2,
    "colors": ["#0D0D0D", "#2D2D2D", "#525252", "#6B6B6B", "#A3A3A3"],
    "harmony": 0.8,
    "start": 259.03999999999996,
    "duration": 19.68653100000006
  },
  "mp3_file": "first-love--late-spring-mitski.mp3"
}
