{
  "incomplete": true,
  "artists": "Lorde",
  "title": "Green Light",
  "duration": 234.997551,
  "lyrics": [
    {
      "timeStamp": 0.16,
      "lyrics": "I do my makeup in somebody else's car"
    },
    {
      "timeStamp": 5.64,
      "lyrics": ""
    },
    {
      "timeStamp": 8.44,
      "lyrics": "We order different drinks at the same bars"
    },
    {
      "timeStamp": 15.43,
      "lyrics": "I know about what you did and I wanna scream the truth"
    },
    {
      "timeStamp": 21.12,
      "lyrics": ""
    },
    {
      "timeStamp": 23.25,
      "lyrics": "She thinks you love the beach, you're such a damn liar"
    },
    {
      "timeStamp": 30.2,
      "lyrics": "Those great whites, they have big teeth"
    },
    {
      "timeStamp": 34.51,
      "lyrics": "Hope they bite you"
    },
    {
      "timeStamp": 35.91,
      "lyrics": "Thought you said that you would always be in love"
    },
    {
      "timeStamp": 38.42,
      "lyrics": "But you're not in love no more"
    },
    {
      "timeStamp": 41.83,
      "lyrics": "Did it frighten you"
    },
    {
      "timeStamp": 43.19,
      "lyrics": "How we kissed when we danced on the light up floor?"
    },
    {
      "timeStamp": 45.98,
      "lyrics": "On the light up floor"
    },
    {
      "timeStamp": 49.28,
      "lyrics": "But I hear sounds in my mind"
    },
    {
      "timeStamp": 56.86,
      "lyrics": "Brand new sounds in my mind"
    },
    {
      "timeStamp": 62.21,
      "lyrics": "But honey I'll be seein' you 'ever I go"
    },
    {
      "timeStamp": 69.83,
      "lyrics": "But honey I'll be seein' you down every road"
    },
    {
      "timeStamp": 74.95,
      "lyrics": "I'm waiting for it, that green light, I want it"
    },
    {
      "timeStamp": 77.17,
      "lyrics": "'Cause honey I'll come get my things, but I can't let go"
    },
    {
      "timeStamp": 82.29,
      "lyrics": "I'm waiting for it, that green light, I want it"
    },
    {
      "timeStamp": 84.69,
      "lyrics": "Oh, I wish I could get my things and just let go"
    },
    {
      "timeStamp": 89.8,
      "lyrics": "I'm waiting for it, that green light, I want it"
    },
    {
      "timeStamp": 93.49,
      "lyrics": "Sometimes I wake up in a different bedroom"
    },
    {
      "timeStamp": 99.34,
      "lyrics": ""
    },
    {
      "timeStamp": 101.47,
      "lyrics": "I whisper things, the city sings 'em back to you"
    },
    {
      "timeStamp": 108.44,
      "lyrics": "All those rumors, they have big teeth"
    },
    {
      "timeStamp": 112.6,
      "lyrics": "Hope they bite you"
    },
    {
      "timeStamp": 113.1,
      "lyrics": "Thought you said that you would always be in love"
    },
    {
      "timeStamp": 116.63,
      "lyrics": "But you're not in love no more"
    },
    {
      "timeStamp": 120,
      "lyrics": "Did it frighten you"
    },
    {
      "timeStamp": 121.36,
      "lyrics": "How we kissed when we danced on the light up floor?"
    },
    {
      "timeStamp": 124.3,
      "lyrics": "On the light up floor"
    },
    {
      "timeStamp": 127.38,
      "lyrics": "But I hear sounds in my mind"
    },
    {
      "timeStamp": 135.09,
      "lyrics": "Brand new sounds in my mind"
    },
    {
      "timeStamp": 140.54,
      "lyrics": "But honey I'll be seein' you 'ever I go"
    },
    {
      "timeStamp": 147.8,
      "lyrics": "But honey I'll be seein' you down every road"
    },
    {
      "timeStamp": 153.12,
      "lyrics": "I'm waiting for it, that green light, I want it"
    },
    {
      "timeStamp": 155.39,
      "lyrics": "'Cause honey I'll come get my things, but I can't let go"
    },
    {
      "timeStamp": 160.41,
      "lyrics": "I'm waiting for it, that green light, I want it"
    },
    {
      "timeStamp": 162.82,
      "lyrics": "Oh, honey I'll come get my things, but I can't let go"
    },
    {
      "timeStamp": 167.91,
      "lyrics": "I'm waiting for it, that green light, I want it"
    },
    {
      "timeStamp": 170.13,
      "lyrics": "Yes, honey I'll come get my things, but I can't let go"
    },
    {
      "timeStamp": 175.46,
      "lyrics": "I'm waiting for it, that green light, I want it"
    },
    {
      "timeStamp": 177.61,
      "lyrics": "Oh, I wish I could get my things and just let go"
    },
    {
      "timeStamp": 182.72,
      "lyrics": "I'm waiting for it, that green light, I want it"
    },
    {
      "timeStamp": 187.58,
      "lyrics": ""
    },
    {
      "timeStamp": 190.22,
      "lyrics": "I'm waiting for it, that green light, I want it"
    },
    {
      "timeStamp": 195.16,
      "lyrics": ""
    },
    {
      "timeStamp": 197.65,
      "lyrics": "I'm waiting for it, that green light, I want it"
    },
    {
      "timeStamp": 205.03,
      "lyrics": "I'm waiting for it, that green light, I want it"
    },
    {
      "timeStamp": 209.96,
      "lyrics": ""
    },
    {
      "timeStamp": 212.56,
      "lyrics": "I'm waiting for it, that green light, I want it"
    },
    {
      "timeStamp": 217.72,
      "lyrics": ""
    },
    {
      "timeStamp": 219.9,
      "lyrics": "I'm waiting for it, that green light, I want it"
    },
    {
      "timeStamp": 225.01,
      "lyrics": ""
    },
    {
      "timeStamp": 227.49,
      "lyrics": "I'm waiting for it, that green light, I want it"
    },
    {
      "timeStamp": 230.5,
      "lyrics": ""
    }
  ],
  "lyricsAnnotations": [
    {
      "lyrics": "Did it frighten you\n How we kissed when we danced on the light up floor?\n On the light up floor",
      "annotation": [
        "Her ex appears to have been frightened by the relationship. That’s why he chose to cheat, to sabotage the relationship as soon as he felt it was becoming too serious.\n\nThis is also a reference to the proverbial ‘green light’.\n\nThe “light up floor” could also be the concept of being in the public eye and the idea of dancing on it creates the idea that their relationship was viewed by many. Now she’s questioning her ex’s experience of being a semi-public figure by being in a relationship with her. Perhaps he couldn’t handle her fame, and their relationship being subjected to the public eye."
      ]
    },
    {
      "lyrics": "Sometimes I wake up in a different bedroom",
      "annotation": [
        "Melodrama is an album that lives more in the night time  and to make you feel/see more this “night vibe”, Lorde uses the bedroom not just to mention the place but also the situation.\n\nAlong with this “different bedroom”, she also mentions her “wardrobe on the bedroom floor” in The Louvre. It’s quite a common thing to associate the bedroom as a place that lives and thrives at night–like Lorde herself. After the manic energy of the night dissipates, Lorde wakes up in someone else’s bedroom after spending the night with them."
      ]
    },
    {
      "lyrics": "I whisper things, the city sings ’em back to you",
      "annotation": [
        "Being a celebrity means that if you put something in a song, the world’s going to hear it and want to dissect it (that’s why this site exists!). Even if she wants to keep her feelings a secret, releasing them in a single means they’ll eventually reach the person she’s singing about, but not before people begin interpreting it and spreading rumors about the meanings, as she discusses in the next line.\n\nIn this case, it connects to the first verse’s line about the beach, especially when considering a picture went viral with her and her ex at the beach four years before the song came out.\n\n\n\nAdditionally, a line in Florence + The Machine’s “No Light No Light” elaborates on what Lorde is writing here – Lorde even mentioned that Flo was an influence while writing “Green Light” on Tavi Gevinson’s Rookie podcast:\n\nhttps://genius.com/5226901"
      ]
    },
    {
      "lyrics": "But I hear sounds in my mind\n Brand new sounds in my mind",
      "annotation": [
        "Ella gained a new perspective after she called off her former relationship. “New sounds” may allude to new love she’s found with someone else or within the variety of experiences she’s living through now that she is single.\n\nLorde stated multiple times throughout the past couple of years that her sound has evolved since the release of 2013’s Pure Heroine. She described “Green Light” as “very different”, with her new music largely drawing on inspiration from her ex. She also made the second line her Instagram bio after the song dropped:\n\n\n\nElla also has synesthesia, a rare neurological condition which allows her to “see” color in her mind when she hears sounds."
      ]
    },
    {
      "lyrics": "I do my makeup in somebody else’s car\n We order different drinks at the same bars",
      "annotation": [
        "Lorde arriving in a different car than her ex and ordering a different drink than him represents their emotional distance.\n\nThey’re not drinking together; they’re just drinking at the same bar, not necessarily with each other. This represents their similarities that will never change after a breakup: even if they hate each other, they still love the same bar.\n\n“Green Light” is her call for closure, so the line sets up the narrative for the rest of the song."
      ]
    },
    {
      "lyrics": "I know about what you did and I wanna scream the truth\n She thinks you love the beach, you’re such a damn liar",
      "annotation": [
        "Not only did Lorde’s ex cheat on her, but also he lied about loving the beach to impress his new girlfriend, but Lorde knows he really doesn’t like it. She spoke about this lyric in an interview with Beats 1:\n\nI say, ‘She thinks you love the beach, you’re such a liar.’ What the fuck, she thinks you like the beach?! You don’t like the beach! It’s those little stupid things.\n\nIt’s also interesting to note that rather than using “fool” in the last line, which would be a slant rhyme for “truth,” Ella chooses “liar” to draw emphasis to her frustration. She used a similar rhyme switch-up on 2014’s “Glory and Gore,” using “brain” in place of the more obvious “head”:\n\nWide awake in bed\nWords in my brain"
      ]
    },
    {
      "lyrics": "But honey, I’ll be seein’ you ’ever I go\n But honey, I’ll be seein’ you down every road\n I’m waiting for it, that green light, I want it",
      "annotation": [
        "Like a driver waiting for a stoplight to turn green so they can go, Lorde is waiting for her love to fade so that she can leave her relationship and go on with her life. More than anything, the line represents her desire for closure and inability to get it.\n\nContrary to what some first believed, this is not a reference to “The Green Light” symbol from F. Scott Fitzgerald’s book  The Great Gatsby:\n\nGreen may be interpreted as a representation for envy, but here in this song interpreting green as a representation of a new start, a new flourishing, is more fitting."
      ]
    },
    {
      "lyrics": "Well, those great whites, they have big teeth\n Hope they bite you\n Thought you said that you would always be in love\n But you’re not in love no more",
      "annotation": [
        "Lorde’s lover was unfaithful, causing her to fantasize about him getting bitten by a great white shark at the beach that he now claims to enjoy.\n\nThe “great whites” aren’t literal sharks. She’s basically saying her ex James Lowe is now among the “big boys”, likely due to his newfound fame as a pop star’s ex-lover. She thinks he’s not really at his environment in this situation, and as such not prepared to deal with it.\n\nThis is also a play on the idiom “white lies”, lies that don’t seem to hurt anybody. Her ex is lying that he loves the beach and she hopes that it “comes back to bite him” with his new lover.\n\nLastly, this is a subtle reference to her song “White Teeth Teens,” in which Lorde criticizes the shallowness of cliques. This line continues Lorde’s fascination with mentioning teeth in her songs, which she discussed in an old Reddit AMA:"
      ]
    }
  ],
  "sections": [
    {
      "explanation": "The verse builds a narrative of betrayal and self-examination.",
      "mood": [
        "introspective",
        "betrayed"
      ],
      "chaos_level": 0.3,
      "energy": 0.4,
      "texture": 0.3,
      "colors": [
        "#D9E1F2",
        "#A3AFC2",
        "#6D88A1",
        "#8297B3",
        "#C3D3E4"
      ],
      "harmony": 0.6,
      "start": 0.16,
      "duration": 74.35
    },
    {
      "explanation": "The song transitions to the pre-chorus, introducing a buildup with an emotional heartbeat.",
      "mood": [
        "anxious",
        "yearning"
      ],
      "chaos_level": 0.4,
      "energy": 0.5,
      "texture": 0.4,
      "colors": [
        "#C4CAD9",
        "#7A869D",
        "#5C6A87",
        "#A8B8CC",
        "#D1DBE8"
      ],
      "harmony": 0.6,
      "start": 74.95,
      "duration": 62.17
    },
    {
      "explanation": "The chorus explodes in energy, expressing a desire for closure and liberty.",
      "mood": [
        "hopeful",
        "energetic"
      ],
      "chaos_level": 0.6,
      "energy": 0.8,
      "texture": 0.5,
      "colors": [
        "#B2D1E0",
        "#6A9DB3",
        "#5082A2",
        "#90B7C8",
        "#D3E3F1"
      ],
      "harmony": 0.8,
      "start": 137.12,
      "duration": 53.87
    },
    {
      "explanation": "The repetition of the chorus with slight variations reinforces the emotional themes.",
      "mood": [
        "hopeful",
        "urgent"
      ],
      "chaos_level": 0.6,
      "energy": 0.85,
      "texture": 0.5,
      "colors": [
        "#ADD8F0",
        "#6DAFCB",
        "#4E91B6",
        "#94C4DC",
        "#D5EBF7"
      ],
      "harmony": 0.8,
      "start": 190.22,
      "duration": 37.81
    }
  ],
  "song_start": {
    "explanation": "The song begins with a slow, introspective mood, where the protagonist reflects on a past relationship.",
    "mood": [
      "reflective",
      "melancholic"
    ],
    "chaos_level": 0.2,
    "energy": 0.3,
    "texture": 0.2,
    "colors": [
      "#E0D7F6",
      "#94B0C2",
      "#738FA7",
      "#B2C7C8",
      "#A5B8B6"
    ],
    "harmony": 0.7,
    "start": 0,
    "duration": 0.16
  },
  "song_end": {
    "explanation": "The song concludes with repeated longing for liberation, the music fades.",
    "mood": [
      "longing",
      "resigned"
    ],
    "chaos_level": 0.2,
    "energy": 0.4,
    "texture": 0.3,
    "colors": [
      "#D8E8F7",
      "#98BCD4",
      "#78A5C2",
      "#AECDE3",
      "#DFEAF5"
    ],
    "harmony": 0.7,
    "start": 228.03,
    "duration": 6.967550999999986
  },
  "mp3_file": "green-light-lorde.mp3"
}