{
  "spotifyInfo": {
    "incomplete": true
  },
  "artists": "Vampire Weekend",
  "title": "Hannah Hunt",
  "duration": 238.027755,
  "lyrics": [
    {
      "timeStamp": 17.87,
      "lyrics": "A gardener told me some plants move"
    },
    {
      "timeStamp": 22.36,
      "lyrics": "But I could not believe it"
    },
    {
      "timeStamp": 27.1,
      "lyrics": ""
    },
    {
      "timeStamp": 29.47,
      "lyrics": "Til me and Hannah Hunt saw"
    },
    {
      "timeStamp": 33.37,
      "lyrics": "Crawling vines and weeping willows"
    },
    {
      "timeStamp": 38.03,
      "lyrics": "As we made our way from Providence to Phoenix"
    },
    {
      "timeStamp": 45.79,
      "lyrics": ""
    },
    {
      "timeStamp": 47.8,
      "lyrics": "A man of faith said hidden eyes"
    },
    {
      "timeStamp": 52.34,
      "lyrics": "Could see what I was thinking"
    },
    {
      "timeStamp": 57.46,
      "lyrics": ""
    },
    {
      "timeStamp": 59.6,
      "lyrics": "I just smiled and told him that was only true of Hannah"
    },
    {
      "timeStamp": 67.72,
      "lyrics": "And we glided on through Waverly and Lincoln"
    },
    {
      "timeStamp": 77.63,
      "lyrics": "Our days were long, our nights no longer"
    },
    {
      "timeStamp": 82.84,
      "lyrics": "Count the seconds, watching the hours"
    },
    {
      "timeStamp": 87.34,
      "lyrics": "Though we live on the US dollar"
    },
    {
      "timeStamp": 91.91,
      "lyrics": "You and me, we got our own sense of time"
    },
    {
      "timeStamp": 98.59,
      "lyrics": ""
    },
    {
      "timeStamp": 105.67,
      "lyrics": "In Santa Barbara, Hannah cried"
    },
    {
      "timeStamp": 109.88,
      "lyrics": "\"I miss those freezing beaches\""
    },
    {
      "timeStamp": 115.22,
      "lyrics": ""
    },
    {
      "timeStamp": 117.56,
      "lyrics": "I walked into town to buy some kindling for the fire"
    },
    {
      "timeStamp": 125.49,
      "lyrics": "Hannah tore the New York Times up into pieces"
    },
    {
      "timeStamp": 133.36,
      "lyrics": ""
    },
    {
      "timeStamp": 135.57,
      "lyrics": "If I can't trust you, then damn it, Hannah"
    },
    {
      "timeStamp": 140.65,
      "lyrics": "There's no future, there's no answer"
    },
    {
      "timeStamp": 145.18,
      "lyrics": "Though we live on the US dollar"
    },
    {
      "timeStamp": 149.64,
      "lyrics": "You and me we got our own sense of time"
    },
    {
      "timeStamp": 156.57,
      "lyrics": ""
    },
    {
      "timeStamp": 179.42,
      "lyrics": "If I can't trust you, then damn it, Hannah"
    },
    {
      "timeStamp": 184.32,
      "lyrics": "There's no future, there's no answer"
    },
    {
      "timeStamp": 188.88,
      "lyrics": "Though we live on the US dollar"
    },
    {
      "timeStamp": 193.47,
      "lyrics": "You and me we got our own sense of time"
    },
    {
      "timeStamp": 197.74,
      "lyrics": ""
    }
  ],
  "lyricsAnnotations": [
    {
      "lyrics": "If I can’t trust you then damn it, Hannah\n There’s no future, there’s no answer",
      "annotation": [
        "Ezra describes the relationship as a strong one at the beginning, but as the song continues, the strength weakens. Hannah cries and misses the way things used to be; she cannot handle the migration and it’s affecting their love negatively. Ezra has put his all into this girl, who claimed to be steadfastly in love prior to the changes. So if she begins to waver in her love amid the changing setting, he cannot trust her love anymore. He feels cheated and lied to, and if she cannot love him, there is no future together."
      ]
    },
    {
      "lyrics": "Count the seconds, watching hours",
      "annotation": [
        "Most of the narrators on Modern Vampires of the City anxiously watch the clock and worry about their own mortality. “Diane Young”’s protagonist wonders if dyin' young is better than growing old and the narrator of “Don’t Lie” frets over the clicks a clock makes. An ominous clock also ticks in the background of the “Hudson” chorus as the narrator thinks about time on a macro scale and complains “the clock is such a drag”. Koenig revealed he was aware the clock motif was present in an interview but claimed he didn’t set out to write about clocks so much.\n\nThe passage of time is especially relevant to “Hannah Hunt”, as it tells its own story about growing up while serving as an unofficial sequel to a previous VW song, “Run”. Time, as it exists in this song and some of the group’s other works, is influenced by Koenig’s viewing of the aforementioned Picnic At Hanging Rock, which “made [Koenig] think about “time” in a way [he] never had before.”\n\nThe language used – “count” and “watching” – further emphasizes the narrator’s need for empirical evidence for everything. He can’t simply accept the universal truth that time stops for no one, he must count every second to be sure that time is passing."
      ]
    },
    {
      "lyrics": "’Til me and Hannah Hunt",
      "annotation": [
        "Hannah Hunt is a real person who Ezra sat next to in a Buddhism class he took in college.  She’s the vocalist of Dominant Legs, but her name’s pronunciation is different, which is like a joke."
      ]
    },
    {
      "lyrics": "I just smiled and told him\n That was only true of Hannah",
      "annotation": [
        "Ever met someone you were so hot for and in tune with that you thought they could read your mind?"
      ]
    },
    {
      "lyrics": "“I miss those freezing beaches”",
      "annotation": [
        "In the lyrics book, there are quotes around this line, so it’s likely that Hannah ‘cried’ out that she missed those frozen beaches. This probably references the freezing cold water of the north Atlantic coast – after all, they started their journey up in Providence, RI – and symbolizes the times in their relationship prior to whatever the speaker did to hurt the relationship."
      ]
    },
    {
      "lyrics": "Saw crawling vines and weeping willows",
      "annotation": [
        "“Crawling” vines and “weeping” willows are the common names of two species of plants. The adjectives “crawling” and “weeping”  also suggest movement, which is an answer to the previous line which says that “some plants move”.\n\nThe choice of the words “crawling” and “weeping” could also foreshadow the eventual breakdown of the narrator’s relationship with Hannah. Not only can a relationship (read: plant) move, it can crawl and weep. Words with negative connotations: their relationship, breaking down, leads to their persons crawling and weeping.\n\nNow that the narrator and Hannah go crossing the country, seeing the world, the narrator gains in knowledge: he now knows of plants that can move. It can mean this: the narrator learns that what looked like still, sturdy creatures can actually move. Like he learns that a relationship that seems so still and sturdy, might not be.\n\nIn regards to the movements of the plants, the narrator doesn’t actually see crawling plants but learns to examine the plants from a different perspective, using their names to connote movement, thus broadening his definition to something beyond purely epistemological or empirical."
      ]
    },
    {
      "lyrics": "Our days were long, our nights no longer",
      "annotation": [
        "As times get tougher they have to work harder to make ends meet. Their nightlife suffers for this, as they have less opportunities to go out partying at night and likely no longer have sex.\n\nAlternatively, the narrator could mean that the few hours the two are together at night feel as long as the days because they have fallen out of love – they are simply counting the seconds until they can go to work in the morning and be apart again. Or simply that the days were long and the nights short. Meaning they were tired and the good times didn’t last anywhere near enough time."
      ]
    },
    {
      "lyrics": "You and me, we got our own sense of time",
      "annotation": [
        "When this line comes in the first chorus, this ‘own sense of time’ unites the narrator and Hannah – they share a sense of time exclusive from the rest of the world. Here, though, their  ‘own sense of time’ is something different for each – something which divides them.\n\n“Sense” also has a double meaning, he’s referring to actual sense and symbolic “cents”, a subunit of a dollar."
      ]
    },
    {
      "lyrics": "A gardener told me some plants move\n But I could not believe it",
      "annotation": [
        "Ezra Koenig compared the opening to sowing “the first seeds of discontent” in a college relationship—like, literally—in an interview with NME. The opening lyrics are inspired by the movie Picnic at Hanging Rock in which a gardener states that some plants can move before showing a plant reacting to his touch. Ezra:\n\nI watched [the movie] in college and was very moved (and weirded out) by it. It’s a beautiful quiet movie. It made me think about “time” in a way I never had before, and a line of dialogue from the film inspired the song “Hannah Hunt”. I probably saw [the movie] when we were starting to make the first album but I wasn’t ready to explore those ideas in depth until our third album.\n\nThe speaker’s skepticism is paralleled the second verse where the narrator states that a man of faith (another expert), states that, “hidden eyes could see what [the narrator] was thinking.” Again, the narrator largely rejects this claim.\n\nBoth of the narrator’s assumptions regarding botanical locomotion and Hannah’s ability to see what the narrator was thinking (and in a sense be mentally linked through the absolute faith and trust of his relationship) is called into question throughout the song.\n\nThis could also possibly be the narrator showing that he was naive to the fact that things which seem deeply rooted can change, like his relationship with Hannah. His trust in Hannah is strained by the end of the song, with Hannah crying and the narrator leaving, both attempting to reignite the fire in different ways.\n\nIt could also anticipate the ending, like Voltaire’s famous conclusion from Candide, Il faut cultiver notre jardin (“We must tend after our own garden,” or more loosely translated “I'mma do me”)."
      ]
    },
    {
      "lyrics": "And we glided on through Waverly and Lincoln",
      "annotation": [
        "Have these place names have been wildly over-analyzed? The transit westbound from Providence, RI to Santa Barbara, CA – passing through both Nebraska and Arizona along the way – seems simple and elegant enough without taking such a fine-toothed comb to the choice of cities.\n\nYet, Ezra speaks in an interview on “names”, of persons. But it is not farfetched to think this applies to city’s names as well.:\n\n“I probably am a name-fetished. We always like to have very specific words in our songs. And especially on this album. You know, on the first album we had Bran and Walcott and Blake. But I like that on this album, we have taken it to the next level.”\n\nWaverly, Nebraska is a “suburb” of Lincoln, Nebraska. You would “glide on through” both of them in about ten minutes on Interstate-80. Maybe it’s important that the couple is on the same mental wavelength while they drive through the middle of the country, like a centering force in the relationship.\n\nWaverley and Lincoln are also two stops on the Boston-Fitchburg MBTA commuter rail. The “gliding” perhaps suggests a commuter train ride more than a car ride. A train is also a more likely place for Ezra to have happened upon a man of faith. In addition to that, most spellings of this lyric are “Waverley,” not “Waverly” as in Waverly, Nebraska."
      ]
    }
  ],
  "sections": [
    {
      "explanation": "Introduction and first verse, where the narrator describes a gardener's claim and his journey with Hannah.",
      "mood": ["contemplative", "wistful"],
      "chaos_level": 0.2,
      "energy": 0.4,
      "texture": 0.3,
      "colors": ["#6A9FB5", "#82C7C1", "#A4D7EA", "#7FA1B2", "#4987A0"],
      "harmony": 0.85,
      "start": 17.87,
      "duration": 27.92
    },
    {
      "explanation": "The second verse, a man of faith talks to the narrator, and the journey continues.",
      "mood": ["introspective", "calm"],
      "chaos_level": 0.25,
      "energy": 0.45,
      "texture": 0.35,
      "colors": ["#5E94C3", "#A1D3E5", "#CDEFF7", "#789BB3", "#364C63"],
      "harmony": 0.8,
      "start": 47.8,
      "duration": 49.83
    },
    {
      "explanation": "The chorus, reflecting on the relationship and their own sense of time.",
      "mood": ["nostalgic", "serene"],
      "chaos_level": 0.3,
      "energy": 0.5,
      "texture": 0.4,
      "colors": ["#729DBA", "#A0CFE3", "#BFDFF4", "#5B7C99", "#3A4B63"],
      "harmony": 0.9,
      "start": 77.63,
      "duration": 21.96
    },
    {
      "explanation": "The third verse, detailing Hannah's emotional turmoil and actions.",
      "mood": ["melancholy", "troubled"],
      "chaos_level": 0.4,
      "energy": 0.5,
      "texture": 0.5,
      "colors": ["#9DB6C2", "#B2D8E8", "#CAD8F6", "#708997", "#3D535E"],
      "harmony": 0.75,
      "start": 105.67,
      "duration": 50.9
    },
    {
      "explanation": "The final section shifts to a more intense and emotional repetition of key lines.",
      "mood": ["intense", "somber"],
      "chaos_level": 0.5,
      "energy": 0.6,
      "texture": 0.6,
      "colors": ["#7E9EB2", "#80C1D6", "#A9D9E8", "#607893", "#2A3E50"],
      "harmony": 0.7,
      "start": 179.42,
      "duration": 58.61
    }
  ],
  "song_start": {
    "explanation": "The song begins with a soft and melancholic introduction, setting the reflective and emotional tone.",
    "mood": ["reflective", "melancholic"],
    "chaos_level": 0.2,
    "energy": 0.3,
    "texture": 0.2,
    "colors": ["#4A90E2", "#7B8DA3", "#C8D6E5", "#9BAEC6", "#576574"],
    "harmony": 0.8,
    "start": 0,
    "duration": 17.87
  },
  "song_end": {
    "explanation": "A calm resolution as the song fades out.",
    "mood": ["calm", "reflective"],
    "chaos_level": 0.2,
    "energy": 0.3,
    "texture": 0.2,
    "colors": ["#4B708A", "#6A98B5", "#A2C4DC", "#86A9C6", "#50697E"],
    "harmony": 0.85,
    "start": 238.02999999999997,
    "duration": -0.0022449999999594183
  },
  "mp3_file": "hannah-hunt-vampire-weekend.mp3"
}
