{
  "key": "5",
  "mode": "1",
  "valence": "0.9",
  "danceability": "0.546",
  "energy": "0.748",
  "tempo": "145.582",
  "genre": "piano",
  "artists": "Kate Bush",
  "title": "Hounds of Love",
  "duration": 182.909388,
  "lyrics": [
    {
      "timeStamp": 1.03,
      "lyrics": "It's in the trees"
    },
    {
      "timeStamp": 2.46,
      "lyrics": "It's coming"
    },
    {
      "timeStamp": 4.46,
      "lyrics": "When I was a child, running in the night"
    },
    {
      "timeStamp": 8.29,
      "lyrics": "Afraid of what might be"
    },
    {
      "timeStamp": 11.22,
      "lyrics": "Hiding in the dark, hiding in the street"
    },
    {
      "timeStamp": 14.78,
      "lyrics": "And of what was following me"
    },
    {
      "timeStamp": 20.88,
      "lyrics": "The hounds of love are hunting"
    },
    {
      "timeStamp": 27.46,
      "lyrics": "I've always been a coward"
    },
    {
      "timeStamp": 34.03,
      "lyrics": "And I don't know what's good for me"
    },
    {
      "timeStamp": 38.83,
      "lyrics": "Oh, here I go"
    },
    {
      "timeStamp": 42.04,
      "lyrics": "It's coming for me through the trees"
    },
    {
      "timeStamp": 46.97,
      "lyrics": "Oh, help me, someone"
    },
    {
      "timeStamp": 48.55,
      "lyrics": "Help me, please"
    },
    {
      "timeStamp": 53.69,
      "lyrics": "Take my shoes off"
    },
    {
      "timeStamp": 55.78,
      "lyrics": "And throw them in the lake"
    },
    {
      "timeStamp": 58.73,
      "lyrics": "And I'll be two steps on the water"
    },
    {
      "timeStamp": 66.96,
      "lyrics": "I found a fox caught by dogs"
    },
    {
      "timeStamp": 70.6,
      "lyrics": "He let me take him in my hands"
    },
    {
      "timeStamp": 73.77,
      "lyrics": "His little heart, it beats so fast"
    },
    {
      "timeStamp": 77.48,
      "lyrics": "And I'm ashamed of running away"
    },
    {
      "timeStamp": 79.91,
      "lyrics": "From nothing real"
    },
    {
      "timeStamp": 81.88,
      "lyrics": "I just can't deal with this"
    },
    {
      "timeStamp": 84.6,
      "lyrics": "I'm still afraid to be there"
    },
    {
      "timeStamp": 90.05,
      "lyrics": "Among the hounds of love"
    },
    {
      "timeStamp": 96.74,
      "lyrics": "And feel your arms surround me"
    },
    {
      "timeStamp": 103.15,
      "lyrics": "I've always been a coward"
    },
    {
      "timeStamp": 109.87,
      "lyrics": "And never know what's good for me"
    },
    {
      "timeStamp": 114.67,
      "lyrics": "Oh, here I go, don't let me go"
    },
    {
      "timeStamp": 120.64,
      "lyrics": "Hold me down"
    },
    {
      "timeStamp": 123.77,
      "lyrics": "It's coming for me through the trees"
    },
    {
      "timeStamp": 129.48,
      "lyrics": "Oh, help me, darling"
    },
    {
      "timeStamp": 130.99,
      "lyrics": "Help me, please"
    },
    {
      "timeStamp": 136.23,
      "lyrics": "Take my shoes off"
    },
    {
      "timeStamp": 138.13,
      "lyrics": "And throw them in the lake"
    },
    {
      "timeStamp": 141.18,
      "lyrics": "And I'll be two steps on the water"
    },
    {
      "timeStamp": 149.26,
      "lyrics": "I don't know what's good for me"
    },
    {
      "timeStamp": 151.32,
      "lyrics": "I don't know what's good for me"
    },
    {
      "timeStamp": 153.18,
      "lyrics": "I need love, love, love, love, love, yeah"
    },
    {
      "timeStamp": 158.22,
      "lyrics": "Your love"
    },
    {
      "timeStamp": 162.36,
      "lyrics": "And take your shoes off"
    },
    {
      "timeStamp": 164.6,
      "lyrics": "And throw them in the lake"
    },
    {
      "timeStamp": 169.07,
      "lyrics": "Do you know what I really need?"
    },
    {
      "timeStamp": 170.93,
      "lyrics": "Do you know what I really need?"
    },
    {
      "timeStamp": 173.26,
      "lyrics": "Love, love, love, love, love, yeah"
    },
    {
      "timeStamp": 176.59,
      "lyrics": ""
    }
  ],
  "lyricsAnnotations": [
    {
      "lyrics": "From nothing real, I just can’t deal with this\n I’m still afraid to be there",
      "annotation": [
        "She doesn’t believe in “love”. It appears that she finds it as a distraction and a chore, instead of a real emotion as she’s never felt it and never wants to. It could link to a fear of the vulnerability love imposes being used against her, and due to her inexperience she wouldn’t notice it. She may feel ashamed of the fact she is so afraid and opposed to a feeling, as it is not a physical threat, yet she may still feel as though she is prey being chased by a predator and would rather be safe than sorry, not willing to let any guard down.\nShe may have unconscious fears of things such as abandonment and betrayal, which prevent her from any reciprocation of love. It could have stemmed from a past relationship, or as I believe is more likely here, a fear of how overwhelming it seems to be to love and be loved and eventually lose."
      ]
    },
    {
      "lyrics": "When I was a child, running in the night\n Afraid of what might be\n Hiding in the dark, hiding in the street\n And of what was following me",
      "annotation": [
        "Love seems to be a predicament that she’s never been certain of and always had a fear of since she was a child. She knew she felt something, but there was possibly a sign of it being something other than love. Fear and love are very similar: heart racing, dizziness, fatigue, obsession – so if learnt young, the emotion of love could be extremely distorted. As a result, she feels it is too great of a risk to test the emotion (whether it is love or not), as it poses a risk of her being deceived.\nChildren have little sense of the real world, and would rather be carefree than have to live with constant fear and worry of which comes with maturity as we age older. There is definitely an issue in her eyes (possibly due to the environment around her), alike how a child may be unable to fully comprehend issues yet know they are negative.\nIt could symbolise the fact that love isn’t something she’s at all familiar with, and therefore wants to escape it before it can develop to something worse before it becomes a habit."
      ]
    },
    {
      "lyrics": "Oh, here I go\n It’s coming for me through the trees",
      "annotation": [
        "As this sentiment is repeated throughout the song, it begins to take on a different tone. At first it sounds as though the singer wants to escape, but it becomes clear that the fear and anxiety is mixed with desire and anticipation."
      ]
    },
    {
      "lyrics": "I don’t know what’s good for me\n I don’t know what’s good for me\n I need love, love, love, love, love, yeah\n Yeah-yo, yeah-yo, your love",
      "annotation": [
        "The singer doesn’t trust her own instincts, and is placing her faith in the man she’s met instead."
      ]
    },
    {
      "lyrics": "Oh, here I go, don’t let me go\n Hold me down\n It’s coming for me through the trees",
      "annotation": [
        "It’s coming for her, but she wants him to hold her down and not let her go, so she can’t escape, because she doesn’t want her fear to get in the way. “Hold me down” is possibly a double entendre."
      ]
    },
    {
      "lyrics": "I found a fox caught by dogs\n He let me take him in my hands\n His little heart, it beat so fast\n And I’m ashamed of running away",
      "annotation": [
        "By comparing herself to the saviour of a small, vulnerable creature, she explains that she feels as if she’s her partner’s source of emotional support – cradling him.\n\nShe can’t bear to leave because she knows that her partner is too vulnerable to be left on his own.\n\nAlternatively, Kate might be finding the plight of someone/something else to dwarf her own fear, which makes her feel bad for (over)reacting and being cowardly when she has the power to comfort."
      ]
    },
    {
      "lyrics": "Take my shoes off and throw them in the lake\n And I’ll be\n Two steps on the water",
      "annotation": [
        "The use of water imagery suggests Kate is ready to take the plunge and enter a relationship.\n\nKate talks about her reasons for using “two steps”, saying:\n\nTwo steps is a progression. One step could possibly mean you go forward and then you come back again. I think “two steps” suggests that you intend to go forward.\n\n(Source: Gaffaweb)"
      ]
    },
    {
      "lyrics": "Oh, help me, darling, help me, please",
      "annotation": [
        "Contrasting with previous lines in this song, Kate now directly asks her lover for help. In taking the risk of falling in love she’s gained someone she can trust and finds sanctuary in them.\n\nThe fact that Kate has found someone to look after her detracts some of the terror from the song, overcoming the initial fear of falling in love and putting your trust in someone."
      ]
    },
    {
      "lyrics": "Oh, help me, someone, help me, please",
      "annotation": [
        "“Hounds of Love” has been compared to Kate’s iconic “Running Up That Hill” for its similar use of vocal to portray a sense of hysteria.\n\nIn “Hounds of Love” there’s an energy of despair, yes. It’s about someone terrified, who is searching for a way to escape something. My voice, and the entire production, are directed towards the expression of that terror.\n\n(Source: Gaffaweb)\n\nKate sings these lines with a raw emotion. She presents herself as isolated and desperate, seemingly pleading to the listener to reach out and save her from her fears."
      ]
    },
    {
      "lyrics": "It’s in the trees, it’s coming!",
      "annotation": [
        "In a 1992 Radio 1 interview with Richard Skinner, Bush explained this intro:\n\n[‘Hounds of Love’] was inspired in some ways by this old black and white movie that is a real favorite of ours, called Night of the Demon. It’s all about this demon that appears in the trees. And the line at the top of the song, ‘It’s in the trees—It’s coming!’, is actually taken from the film. Maurice Denham is the guy that sang it.\n\nAs Bush herself says, these lines are from 1957 horror film Night of the Demon. Starring actor Maurice Denham speaks them."
      ]
    }
  ],
  "sections": [
    {
      "explanation": "The introduction and initial verse, exploring themes of fear and childhood.",
      "mood": ["fearful", "introspective", "haunting"],
      "chaos_level": 0.4,
      "energy": 0.5,
      "texture": 0.3,
      "colors": ["#4B0082", "#6A5ACD", "#8A2BE2", "#9370DB", "#483D8B"],
      "harmony": 0.5,
      "start": 0,
      "duration": 20
    },
    {
      "explanation": "The chorus, expressing the hounds of love and the protagonist's fear and avoidance.",
      "mood": ["intense", "desperate", "dramatic"],
      "chaos_level": 0.6,
      "energy": 0.9,
      "texture": 0.4,
      "colors": ["#8B0000", "#B22222", "#FF4500", "#DC143C", "#FF6347"],
      "harmony": 0.6,
      "start": 20,
      "duration": 30
    },
    {
      "explanation": "The second verse, diving deeper into the metaphor of the hounds and the protagonist's fear.",
      "mood": ["reflective", "emotional", "mournful"],
      "chaos_level": 0.5,
      "energy": 0.6,
      "texture": 0.4,
      "colors": ["#7B68EE", "#6A5ACD", "#5F9EA0", "#4682B4", "#4169E1"],
      "harmony": 0.7,
      "start": 50,
      "duration": 30
    },
    {
      "explanation": "The bridge, introducing new imagery and connecting the themes of fear and desire.",
      "mood": ["hopeful", "transformative", "yearning"],
      "chaos_level": 0.4,
      "energy": 0.7,
      "texture": 0.5,
      "colors": ["#FFD700", "#FFA500", "#FF8C00", "#FF4500", "#DC143C"],
      "harmony": 0.7,
      "start": 80,
      "duration": 30
    },
    {
      "explanation": "The climax and repetition of the chorus, building up emotion and intensity.",
      "mood": ["climactic", "emotional", "powerful"],
      "chaos_level": 0.7,
      "energy": 0.9,
      "texture": 0.6,
      "colors": ["#FF0000", "#FF4500", "#FF6347", "#FFA07A", "#FF7F50"],
      "harmony": 0.6,
      "start": 110,
      "duration": 40
    },
    {
      "explanation": "The outro, closing with the theme of desire and resignation.",
      "mood": ["resigned", "melancholic", "etherial"],
      "chaos_level": 0.3,
      "energy": 0.5,
      "texture": 0.3,
      "colors": ["#2E8B57", "#3CB371", "#20B2AA", "#5F9EA0", "#4682B4"],
      "harmony": 0.8,
      "start": 150,
      "duration": 30
    }
  ],
  "song_start": {
    "explanation": "The song starts with a haunting atmosphere, setting up the theme of fear and anticipation.",
    "mood": ["ominous", "anticipatory", "mystical"],
    "chaos_level": 0.6,
    "energy": 0.4,
    "texture": 0.3,
    "colors": ["#2F4F4F", "#556B2F", "#8B4513", "#708090", "#4682B4"],
    "harmony": 0.4,
    "start": 0,
    "duration": 0
  },
  "song_end": {
    "explanation": "The song ends with a blend of longing and peace, completing the emotional journey.",
    "mood": ["peaceful", "longing", "fulfilled"],
    "chaos_level": 0.2,
    "energy": 0.45,
    "texture": 0.2,
    "colors": ["#00FA9A", "#2E8B57", "#20B2AA", "#5F9EA0", "#4682B4"],
    "harmony": 0.9,
    "start": 180,
    "duration": 2.909388000000007
  },
  "mp3_file": "hounds-of-love-kate-bush.mp3"
}
