{
  "incomplete": true,
  "artists": "Charli xcx & Troye Sivan",
  "title": "Talk talk featuring troye sivan",
  "duration": 173.191837,
  "lyrics": [
    {
      "timeStamp": 0.25,
      "lyrics": "(Talk to me)"
    },
    {
      "timeStamp": 1.3,
      "lyrics": "Troye, baby"
    },
    {
      "timeStamp": 2.9,
      "lyrics": "Hay una fiesta en mi casa, vengan"
    },
    {
      "timeStamp": 5.8100000000000005,
      "lyrics": "Será muy divertido"
    },
    {
      "timeStamp": 7.52,
      "lyrics": "Are we getting too close?"
    },
    {
      "timeStamp": 11.03,
      "lyrics": "You're leaving things in my head"
    },
    {
      "timeStamp": 14.89,
      "lyrics": "I'll be honest, you scare me"
    },
    {
      "timeStamp": 18.48,
      "lyrics": "My life's supposed to be a party (do you ever think about me?)"
    },
    {
      "timeStamp": 24.87,
      "lyrics": "'Cause we talk that talk, and we talk all night"
    },
    {
      "timeStamp": 28.45,
      "lyrics": "And the more I know you, the more I like you"
    },
    {
      "timeStamp": 32.2,
      "lyrics": "Can you stick with me? Maybe just for life?"
    },
    {
      "timeStamp": 34.93,
      "lyrics": "And say what's on your mind? My baby"
    },
    {
      "timeStamp": 38.14,
      "lyrics": "Talk to me in French, talk to me in Spanish"
    },
    {
      "timeStamp": 40.76,
      "lyrics": "Talk to me in your own made-up language"
    },
    {
      "timeStamp": 43.09,
      "lyrics": "Doesn't matter if I understand it (my baby)"
    },
    {
      "timeStamp": 45.48,
      "lyrics": "Talk right in my ear"
    },
    {
      "timeStamp": 46.7,
      "lyrics": "Tell me your secrets and fears"
    },
    {
      "timeStamp": 48.69,
      "lyrics": "Once you talk to me, I'll talk to you"
    },
    {
      "timeStamp": 50.66,
      "lyrics": "And say, \"Hey, can we go back to my place?\""
    },
    {
      "timeStamp": 53.44,
      "lyrics": "'Kay, here's the plan"
    },
    {
      "timeStamp": 54.49,
      "lyrics": "I wanna fly you out to Amsterdam"
    },
    {
      "timeStamp": 56.29,
      "lyrics": "I got a good hotel to fuck you in, I wanna"
    },
    {
      "timeStamp": 60.13,
      "lyrics": "Boy, come see me"
    },
    {
      "timeStamp": 61.8,
      "lyrics": "We could pop our shit to Charli"
    },
    {
      "timeStamp": 63.66,
      "lyrics": "And I need your arms around me"
    },
    {
      "timeStamp": 67.8,
      "lyrics": "Talk to me in French, French, French, French"
    },
    {
      "timeStamp": 70.28,
      "lyrics": "Talk-talk-talk-talk-talk to me in Spanish, Spanish, Spanish, Spanish"
    },
    {
      "timeStamp": 74.09,
      "lyrics": "Talk-talk-talk-talk to me in French, French, French, French"
    },
    {
      "timeStamp": 77.64,
      "lyrics": "Talk-talk-talk-talk-talk to me in Spanish, Spanish"
    },
    {
      "timeStamp": 80.6,
      "lyrics": "Shall we go back to my place?"
    },
    {
      "timeStamp": 82.41,
      "lyrics": "You're thinking 'bout me (thinking 'bout me)"
    },
    {
      "timeStamp": 84.89,
      "lyrics": "No, don't pretend that you aren't (you aren't)"
    },
    {
      "timeStamp": 88.41,
      "lyrics": "We're still obsessed like we just met (just met)"
    },
    {
      "timeStamp": 92.12,
      "lyrics": "And when you fuck me, it's crazy (crazy)"
    },
    {
      "timeStamp": 95.4,
      "lyrics": "You're thinking 'bout me"
    },
    {
      "timeStamp": 98.63,
      "lyrics": "'Cause we talk that talk, and we talk all night"
    },
    {
      "timeStamp": 102.25,
      "lyrics": "And the more I know you, the more I like you"
    },
    {
      "timeStamp": 106,
      "lyrics": "Can you stick with me? Maybe just for life?"
    },
    {
      "timeStamp": 108.82,
      "lyrics": "And say what's on your mind? My baby"
    },
    {
      "timeStamp": 112.02,
      "lyrics": "Talk to me in French, talk to me in Spanish"
    },
    {
      "timeStamp": 114.55,
      "lyrics": "Talk to me in your own made-up language"
    },
    {
      "timeStamp": 116.82,
      "lyrics": "Doesn't matter if I understand it"
    },
    {
      "timeStamp": 119.26,
      "lyrics": "Talk right in my ear"
    },
    {
      "timeStamp": 120.6,
      "lyrics": "Tell me your secrets and fears"
    },
    {
      "timeStamp": 122.49,
      "lyrics": "Once you talk to me, I'll talk to you"
    },
    {
      "timeStamp": 124.45,
      "lyrics": "And say, \"Hey, shall we go back to my place?\""
    },
    {
      "timeStamp": 127.18,
      "lyrics": "'Kay, here's the plan"
    },
    {
      "timeStamp": 128.39,
      "lyrics": "I wanna fly you out to Amsterdam"
    },
    {
      "timeStamp": 130.15,
      "lyrics": "I got a good hotel to fuck you in, I wanna"
    },
    {
      "timeStamp": 133.84,
      "lyrics": "Boy, come see me"
    },
    {
      "timeStamp": 135.64,
      "lyrics": "We could pop our shit to Charli"
    },
    {
      "timeStamp": 137.54,
      "lyrics": "And I need your arms around me"
    },
    {
      "timeStamp": 139.94,
      "lyrics": "Shall we go back to my–"
    },
    {
      "timeStamp": 141.38,
      "lyrics": "Talk to me in French, French, French, French"
    },
    {
      "timeStamp": 144.04,
      "lyrics": "Talk-talk-talk-talk-talk-talk to me in Spanish, Spanish, Spanish, Spanish"
    },
    {
      "timeStamp": 148.01,
      "lyrics": "Talk-talk-talk-talk-talk to me in French, French, French, French"
    },
    {
      "timeStamp": 151.57,
      "lyrics": "Talk-talk-talk-talk-talk-talk to me in Spanish, Spanish"
    },
    {
      "timeStamp": 154.62,
      "lyrics": "Shall we go back to my place?"
    },
    {
      "timeStamp": 156.52,
      "lyrics": "J'ai perdu mon téléphone mais tu sais quoi?"
    },
    {
      "timeStamp": 159.94,
      "lyrics": "Ça valait la peine parce que c'était une soirée de fou"
    },
    {
      "timeStamp": 165.06,
      "lyrics": "Yeah, last night was crazy"
    },
    {
      "timeStamp": 168.37,
      "lyrics": "Let's do it again"
    },
    {
      "timeStamp": 169.39,
      "lyrics": "Shall we go back to my place?"
    },
    {
      "timeStamp": 170.48,
      "lyrics": ""
    }
  ],
  "lyricsAnnotations": [
    {
      "lyrics": "[Intro: Charli xcx, Troye Sivan, Dua Lipa]",
      "annotation": [
        "A few days before the release of the remix with Troye, Charli posted an Instagram story thanking Dua Lipa for speaking in other languages for her in the song and for the various audio files sent by Dua.\n\n\n\n\n\nDua reposted the story writing “i got you in every language.” In fact in the the song Dua Lipa speaks in Spanish and French.\n\nhttps://filepicker-images.genius.com/5b2a82cacff6e845f833b3fe8e03c7b8b2479c3704811cb09eda8388dffb88ab%2Fbv4b956pcgs"
      ]
    },
    {
      "lyrics": "Troye, baby",
      "annotation": [
        "This tag first appeared in Troye’s track “What’s The Time Where You Are?” off of his album Something To Give Each Other and reoccurred again within Troye’s remix of Ariana Grande’s track, “Supernatural”.\nhttp://www.youtube.com/watch?v=5mnwCbIZ6rg"
      ]
    },
    {
      "lyrics": "Let’s do it again",
      "annotation": [
        "Possibly a nod to the final track, ’365’ off the initial version of ”BRAT”, a song that encapsulates the idea of a never ending party and ultimately Charli’s desire to never let it end"
      ]
    },
    {
      "lyrics": "And the more I know you, the more I like you",
      "annotation": [
        "This lyric is a relationship dynamic with a deepening connection between two people, where getting to know each other better strengthens their bond. It implies that as time passes and more is revealed about one person—whether their personality, habits, or inner thoughts—the other person grows fonder. This can point to a healthy relationship built on trust, respect, and mutual appreciation, where understanding fosters greater affection."
      ]
    },
    {
      "lyrics": "My life’s supposed to be a party",
      "annotation": [
        "A longtime collaborator with the quintessential ‘partygirl of the summer’, it’s no surprise that Troye ‘assumes’ his life under the pretences of a party\n\nLate in 2018, Troye was catapulted into the EDM limelight via the now cult-classic track, ’1999’, which later appeared on Charli’s third studio album, the self-titled ”Charli”; an infectious tune, although making little waves in regards to Billboard charting, the track spawned mass attention for a budding Troye over in Charli’s home-country, the UK, with its official music video now amassing over 51 million views, due in course to the pop-culture zeitgeist the two find themselves in\n\nThe two have gone on to be, nowadays, inseparable; appearing on each others TikToks and even going on to commence a collective tour together, Troye’s status amidst the party atmosphere seems undebated. But despite this, the relationship qualms which prominently feature on his albums still exists here\n\nAn undeniable feeling; despite being at the pinnacle of a pop-culture zeitgeist, with even a summer named after the stated album, Troye can’t just ignore his incessant desire to remembered by his previous lovers, a feeling too hard for him to forget despite the parties best efforts"
      ]
    },
    {
      "lyrics": "J’ai perdu mon téléphone mais tu sais quoi\n Ça valait la peine parce que c’était une soirée de fou",
      "annotation": [
        "The French lines in question roughly translate, in English, to:\n\nI lost my phone, but you know what,\nIt was worth it because it was an insane party\n\nSpeaking French is nothing new for Dua Lipa, most notably speaking the language in the sixth track, “French Exit” off of her recently-released third studio album, Radical Optimism."
      ]
    },
    {
      "lyrics": "Hay una fiesta en mi casa, vengan\n Será muy divertido",
      "annotation": [
        "Translation from Spanish to English:\n\nThere is a party at my house, come over\nIt will be very fun"
      ]
    },
    {
      "lyrics": "’Kay, here’s the plan\n I wanna fly you out to Amsterdam\n I got a good hotel to fuck you in, I wanna—",
      "annotation": [
        "Following on from the trend of facing past issues that begun through Lorde’s remix of BRAT’s tenth track, ’girl, so confusing’, Troye tackles his problem surrounding distant love and miscommunication, a concept that crept up most recently throughout his third studio album, ”Something To Give Each Other”\n\nThe miscommunication is at its apparent peak, within the aforementioned album, through both the low-tempo track 5, ’Still Got It’ and its subsequent ballad track of ’Can’t Go Back, Baby’, which sees Troye tackle his inner emotions of a long-lost relation, with him going on to state about track 5:\n\nAll those feelings are there, that familiarity and that sweetness. But there’s also this very strange distance.”\n\nBy the end of the album however, the distance still remains, going onto quote in the last track lines like ”wish you lived a little closer”; but by the last few lyrics, Troye leaves rather open-ended on what he wants in his future and ultimately what he wants in a partner, a point further expanded upon in an interview with Kane Lowe:\n\nThroughout all the experiences and people on the album, I still have this longing and desire to find a long-term relationship.” He goes on “[…] I still haven’t found the thing I’m looking for. It doesn’t negate these prior experiences and how beautiful they are, but I’m still looking. I thought it was a very real way to end it. I’m on this journey, I’m really happy and I’m enjoying every second of it, I’m so grateful for all the connections, and I’m curious to see what happens next.”\n\nIn this track, though, Troye begins to take back his sexual prerogative; giving his respective partner a ‘plan’ to follow, as well as flying them out to Amsterdam rather than just letting the distance maintain between them. In a fashion similar to the boldness, unashamed raw nature of BRAT, Troye is taking a note from Charli and finally trying to kill the distance that’s been persistent throughout his past relations.\n\n\n\nIn the Grammy U Talk, Troye says that this line was quite frankly inspired by a really nice, fancy hotel in the Netherlands that he got put up in for his GAP commercial shoot."
      ]
    },
    {
      "lyrics": "We could pop our shit to Charli",
      "annotation": [
        "Troye shouts out Charli in his verse – a trend that has been seen on almost every other remix so far from Brat.\n\n“Charli likes boys but she knows I’d hit it”\n- Billie Eilish on the “Guess” remix\n\n“I ride for you Charli”\n- Lorde on the “Girl, so confusing” remix\n\n“Cause we’re just livin' that life”\n- Addison Rae and Charli on the “Von dutch” remix\n\n“Your favorite pop star is into me, Yung Lean, and Charli”\n- Robyn and Charli on the “360” remix"
      ]
    }
  ],
  "sections": [
    {
      "explanation": "The opening lines where the setting is introduced as a party scene, and there is a shift to introspective lyrics about relationships.",
      "mood": [
        "playful",
        "contemplative"
      ],
      "chaos_level": 0.4,
      "energy": 0.6,
      "texture": 0.5,
      "colors": [
        "#FF7F50",
        "#FFD700",
        "#8B0000",
        "#FF8C00",
        "#FFA500"
      ],
      "harmony": 0.7,
      "start": 0.25,
      "duration": 18.23
    },
    {
      "explanation": "The first chorus with upbeat and catchy lyrics about connection and conversations, expressing joy and intimacy.",
      "mood": [
        "joyful",
        "romantic"
      ],
      "chaos_level": 0.3,
      "energy": 0.8,
      "texture": 0.6,
      "colors": [
        "#FF69B4",
        "#FF1493",
        "#FF4500",
        "#FFA07A",
        "#F08080"
      ],
      "harmony": 0.9,
      "start": 18.48,
      "duration": 16.39
    },
    {
      "explanation": "A verse with more intimate and whimsical lyrics, mentioning languages and communication, adding a playful tone.",
      "mood": [
        "playful",
        "intimate"
      ],
      "chaos_level": 0.3,
      "energy": 0.7,
      "texture": 0.5,
      "colors": [
        "#FFD700",
        "#FF6347",
        "#FF69B4",
        "#FFA500",
        "#FF4500"
      ],
      "harmony": 0.8,
      "start": 34.93,
      "duration": 26.55
    },
    {
      "explanation": "An energetic and repetitive section focusing on the multilingual phrase 'Talk to me in French, Spanish,' emphasizing the playful nature of language.",
      "mood": [
        "playful",
        "energetic"
      ],
      "chaos_level": 0.3,
      "energy": 0.9,
      "texture": 0.6,
      "colors": [
        "#FF7F50",
        "#FFD700",
        "#FFA07A",
        "#FF4500",
        "#FF8C00"
      ],
      "harmony": 0.8,
      "start": 67.8,
      "duration": 18.6
    },
    {
      "explanation": "A reflective bridge section with a slower pace, introspection, and more focused lyrics about connection and memories.",
      "mood": [
        "reflective",
        "introspective"
      ],
      "chaos_level": 0.2,
      "energy": 0.5,
      "texture": 0.4,
      "colors": [
        "#F0E68C",
        "#FFD700",
        "#FFA500",
        "#FF8C00",
        "#FF4500"
      ],
      "harmony": 0.85,
      "start": 80.6,
      "duration": 20.7
    },
    {
      "explanation": "The second chorus with more emphasis on the joy of connection and the repetition of previous themes, building towards the end.",
      "mood": [
        "joyful",
        "romantic"
      ],
      "chaos_level": 0.3,
      "energy": 0.8,
      "texture": 0.6,
      "colors": [
        "#FF69B4",
        "#FF4500",
        "#FFA07A",
        "#FFD700",
        "#F08080"
      ],
      "harmony": 0.9,
      "start": 101.3,
      "duration": 21.45
    },
    {
      "explanation": "The final section with a party-like atmosphere and a reflective conclusion in French and Spanish, tying back to the song's theme.",
      "mood": [
        "playful",
        "reflective"
      ],
      "chaos_level": 0.3,
      "energy": 0.7,
      "texture": 0.5,
      "colors": [
        "#FFD700",
        "#FF4500",
        "#FF6347",
        "#FFA500",
        "#F0E68C"
      ],
      "harmony": 0.85,
      "start": 165.06,
      "duration": 8.13
    }
  ],
  "song_start": {
    "explanation": "The song begins with an introduction featuring voices and a greeting, setting the tone for a party atmosphere.",
    "mood": [
      "inviting",
      "engaging"
    ],
    "chaos_level": 0.2,
    "energy": 0.5,
    "texture": 0.3,
    "colors": [
      "#FFD700",
      "#FF69B4",
      "#FF4500",
      "#FF6347",
      "#F0E68C"
    ],
    "harmony": 0.8,
    "start": 0,
    "duration": 0.25
  },
  "song_end": {
    "explanation": "The song concludes with a repeating line, emphasizing the cyclical and enduring nature of the themes in the song.",
    "mood": [
      "playful",
      "lingering"
    ],
    "chaos_level": 0.2,
    "energy": 0.5,
    "texture": 0.3,
    "colors": [
      "#FFD700",
      "#FF69B4",
      "#FF4500",
      "#FFA07A",
      "#F08080"
    ],
    "harmony": 0.8,
    "start": 173.19,
    "duration": 0.0018369999999947595
  },
  "mp3_file": "talk-talk-featuring-troye-sivan-charli-xcx-&-troye-sivan.mp3"
}